9/data/attachments/34aa49f2c9f19417.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_fab22856-611d-4f4b-9475-f7710b7ccd0a</nif:username>
            <nif:friendToBeAdded>Joseph_can_Friend_89976_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>